[
    {
        "filename": "Talapushpaputam\\img1.jpg",
        "description": "While the right foot is extended through the Adhyardhika Chari, the hands are brought to the right side with the vyavartana and with the parivartita movements to the left side of the waist, bent in the sannata position. Then, the hands take the pushpaputa pose near the left chest, the feet in agratalasanchara pose. This is used in offering handful of flowers and expressing bashfulness."
    },
    {
        "filename": "Leenam\\img1.jpg",
        "description": "After the urdhvamandala movement, the hands make anjali on the chest. The shoulder blades are raised and the neck bent down. It depicts the entreaties of a lover."
    },
    {
        "filename": "Vartitam\\img1.jpg",
        "description": "After having crossed the hands at the wrists on the chest, palms facing the body and separated, the vyavarta and parivartita movements are made, then the hands fall, palm upwards on the thigh. It indicates jealously, if two pataka hands are made to fall. These with the palms turned down or with palms stroked, indicate fury."
    },
    {
        "filename": "Valitorukam\\img1.jpg",
        "description": "The hands make the vyavarta and parivartita movements simultaneously from the chest and with the akshiptachari are brought together through the parivartana movement, and placed there adopting the shukatunda with the palms facing down. This posture is adopted with the baddhachari. It shows bashfulness of a shy, young girl (mugdha)."
    },
    {
        "filename": "Mandalaswastikam\\img1.jpg",
        "description": "Having taken chaturashra pose of the hands, while performing the vichyavachari, the hands should make urdhvamandala gesture preceded by the udveshtita movement, and then svastika. Here the posture is mandala. It is employed in general purposes."
    },
    {
        "filename": "ArdhaSwastikam\\img1.jpg",
        "description": "The right hand makes the karihasta gesture and the left hand katakamukha pose at the chest. The feet make svastika."
    },
    {
        "filename": "Dikswastikam\\img1.jpg",
        "description": "Svastika karana moves in all directions, turning sideways, to the front, and the back simultaneously, while the hands and feet make the rechita movement, used to indicate the movement of the body while singing."
    },
    {
        "filename": "Prasthaswastikam\\img1.jpg",
        "description": "The arms are extended in the Udveshtita movement and apakrantachari is performed. Then the apaveshtita movement is performed and the other foot makes the rechita movement and suchichari. Then a svastika is formed with the feet and hands. It is employed to indicate rejection, anger, pursuing of enemies."
    },
    {
        "filename": "Swastikam\\img1.jpg",
        "description": "Extending the hands with the udveshthita movement, a vyavarta movement is performed and a jump is made. Then a svastika formed simultaneously with the hands and feet. It indicates the same uses as above."
    },
    {
        "filename": "Anchitam\\img1.jpg",
        "description": "With the vyavarta and parivartita movements, the hand in the karihasta pose is brought near the nose, making alapadma. It indicates great elation, in explaining matters with superiority."
    },
    {
        "filename": "Apaviddham\\img1.jpg",
        "description": "Standing with the chaturashra pose of the hands, the right hand is extended with the vyavarta movement and the akshiptachari is simultaneously performed. Then it would adopt the shukhatunda pose and fall on the right thigh. The left hand is held at the chest in katakamukha. It is to be used to indicate anger and jealousy."
    },
    {
        "filename": "Samanakham\\img1.jpg",
        "description": "The body is in the natural position, the feet level with the toes on the ground. The hands are in the lata pose. It is used in the first entry of the dancer."
    },
    {
        "filename": "Unmattam\\img1.jpg",
        "description": "Performing the aviddhachari, the feet are in the anchita pose. The hands do rechita gesture, one after another. It is used in indicating pride of wealth."
    },
    {
        "filename": "Swastikarechitam\\img1.jpg",
        "description": "After the chaturashra pose, the hands adopt hamsapaksha and make a quick circular movement. Then with the vyavarta and parivartana movements they are brought down and up from the head area. Making the aviddhavakra gesture, they do svastika at the chest. Then they separate and make the pakshavanchita and pakshapradyotaka gestures at the hips. A chari which is suitable to this is made, ending in the avahitthaka posture. It is employed in portraying nritta dance and joy."
    },
    {
        "filename": "Nikuttakam\\img1.jpg",
        "description": "In mandala posture, standing with chaturashra gesture, the right hand is brought with an udvesthita movement to the hump in the same shoulder. With a falling and rising movement of the little finger and the ring finger, alapadma is taken, while the right foot does the udghattita action. Then the hand makes saviddhavakra gesture with the chaturashra pose. In the same way, the movements are made with the left hand and foot. It is used while dancing, expressing self-praising sentences."
    },
    {
        "filename": "Ardhanikuttakam\\img1.jpg",
        "description": "The same when performed on one side is ardhnikuttaka. Same use but the words are not fully developed."
    },
    {
        "filename": "Katisamam\\img1.jpg",
        "description": "After performing the akshipta and apakrantacharis and forming a svastika with hands, the right hand is placed on the navel in the khatakamukha and the other on the waist in the ardhachandra poses. Left side is in the nata pose, and the right is raised. This is repeated on the other side. It is accompanied by the Vaishnava posture, used by the stage manager or sutradhara while consecration of the jarjara."
    },
    {
        "filename": "Bhujangatraasitam\\img1.jpg",
        "description": "After bhujangatrasitachari, throw up the foot in the Kunchita position, make such a movement that the thighs, waist and knee make a triangle. With the vyavarta and parivartita movements, one hand takes dola and the other katakamukha, meaning frightened by serpent."
    },
    {
        "filename": "Alaatakam\\img1.jpg",
        "description": "The alatachari is done with the right foot. The right hand does the nitamba gesture in chaturashra pose. The urdhvajanuchari is performed with the left foot and repeated on the other side, used for graceful nritta."
    },
    {
        "filename": "Vikshiptaakshiptakam\\img1.jpg",
        "description": "While one hand performs the vyavarta movement, the same foot is stretched. The other hand in chaturashra, the former hand makes the parivartana movement and the foot is brought back. It is repeated on the other side, used to indicate going and coming. This is to be used in between pieces of abhinaya, in moving about, in the charis and sthanakas, in fights and keeping time or tala."
    },
    {
        "filename": "Nikunchitam/img1.jpg",
        "description": "After performing vruschika karana, the hand on the same side in arala is put on the side of the head. The other hand in arala as well is brought from the nose to the chest. This indicates jumping up and anxiety. Pataka and such yasya hands can be placed at the tip of the nose as well."
    },
    {
        "filename": "Ghoornitam/img1.jpg",
        "description": "While the right hand is raised in the vyavartana movement and lowered in the parivartana movement, nyanakasvastika is made. Then the apakrantachari is done with the left foot, left hand is in the dola pose."
    },
    {
        "filename": "Urdhvajaanu/img1.jpg",
        "description": "While the foot is in kunchita pose and the urdhvajanuchari is being performed, the hand on that side has the alapadma or arala, pointing up. The pakshavanchitaka pose is made above the knee on level with chest. The other hand is in katakamukha at the chest."
    },
    {
        "filename": "Ardhrechitakam/img1.jpg",
        "description": "Standing in the mandala sthanaka, one hand in katakamukha is at the chest, the other moves away and then takes the suchimukha near the chest. The foot makes the udghattita movement on that side which is in sannata. It is for depicting running away and also evil intended actions."
    },
    {
        "filename": "Mattali/img1.jpg",
        "description": "Having made a svastika with the ankles the feet separate and simultaneously the hands make udveshthana and apaveshthana movements repeatedly; used to indicate intoxication."
    },
    {
        "filename": "Ardhamattali/img1.jpg",
        "description": "The right hand makes movements like nittamba and keshabandha. The feet move away, left hand makes a partial rechita movement, used to indicate slight intoxication."
    },
    {
        "filename": "Rechitanikuttitam/img1.jpg",
        "description": "The right hand makes the rechita movement and right foot makes the udghattita movement. The left hand is in dola pose."
    },
    {
        "filename": "Lalitam/img1.jpg",
        "description": "The right hand is as above movement and the other makes the karihasta gesture. The foot makes the udghattita movement. This is repeated on the other side, used to indicate graceful dancing."
    },
    {
        "filename": "Valitam/img1.jpg",
        "description": "The hand in the suchimukha is moved away from the chest. The foot in the suchi is also moved away. Then the bhramarichari is performed. This is done on both sides, used to indicate the graceful."
    },
    {
        "filename": "Dandapaksham/img1.jpg",
        "description": "First the urdhvajanuchari is performed. The hands make the lata gesture. One of them is then placed above the knee and repeated on the other side."
    },
    {
        "filename": "Paadaapaviddhakam/img1.jpg",
        "description": "The two hands pointing out are placed near the navel in katakamukha. One foot in the suchi pose is brought to touch the other and the apakrantachari is performed."
    },
    {
        "filename": "Noopuram/img1.jpg",
        "description": "After bhramarichari, nupurapadikachari is performed with one foot. The hand on the same side makes the rechita movement and the other is in the lata pose."
    },
    {
        "filename": "Bhramarakam/img1.jpg",
        "description": "The foot in the akshiptachari, the udveshthita movement is made with the hand. The lower part of the back is curved around and the feet form a svastika. The same is repeated on the other side and simultaneously the hands make the ulbana gesture. This is bhramara and is to be used in moving about arrogantly."
    },
    {
        "filename": "Chinnam/img1.jpg",
        "description": "The hands in the alapadma pose are placed at side of the hips in sequence while the waist takes the chinna position, this Vaishakha posture of body is used in checking the time or tala and in resting the limbs."
    },
    {
        "filename": "Bhujangatrastarechitam/img1.jpg",
        "description": "Bhujangatrasitachari is performed, then the rechita gesture is made with the hands which are brought to the left side."
    },
    {
        "filename": "Bhujangaanchitakam/img1.jpg",
        "description": "The above is performed with the right foot and the right hand makes the rechita movement, the left in the lata posture."
    },
    {
        "filename": "Dandakarechitam/img1.jpg",
        "description": "The dandapadachari is performed and the hands make the dandapaksha gesture; used in joyful dancing or in vigorous movement."
    },
    {
        "filename": "Chaturam/img1.jpg",
        "description": "Hands near the chest, the left takes the alapallava and the right chatura. One foot makes the udghattita movement, employed to indicate the actions of the vidushaka producing wonder."
    },
    {
        "filename": "Katibhraantam/img1.jpg",
        "description": "After the suchi pose, the left foot moves away quickly, the right foot is placed on that side and simultaneously the rechaka movement is made with the hips and the vyavarta and parivartita movements. The hands make chaturashra in the end. It fills up the pauses in musician between the talas and also in moving about."
    },
    {
        "filename": "Vyamsitam/img1.jpg",
        "description": "One hand is spread out below by an udveshthita movement; the other hand is stretched out in the same way and is brought back to the region of the chest. Then one hand makes the rechita gesture, palm facing up and the other makes the rechita facing down, to indicate the movement of great monkeys like Hanuman."
    },
    {
        "filename": "Kraantam/img1.jpg",
        "description": "Performing the atikrantachari, the foot that comes down is bent and same time, the hand is extended in the vyvarta movement. Bringing it back with the parivartana movement, the katakamukha pose is adopted at the chest. This is repeated on the other side, used in vigorous movement."
    },
    {
        "filename": "Vaishaakarechitam/img1.jpg",
        "description": "Rechaka movements are made with the hands, feet, waist while the neck and the standing posture is rechakasthanaka."
    },
    {
        "filename": "Vrishchikam/img1.jpg",
        "description": "Hands make the karihasta gesture, the feet are kept at the back like the tail of a scorpion with the back being bent deep, used for aerial movement of Airavata and others."
    },
    {
        "filename": "Vrishchikarechitam/img1.jpg",
        "description": "The feet take the pose of vrishchika and the hands in alapadma pose are moved up and down successively at the shoulders. It is used for wonder, aerial movement, etc."
    },
    {
        "filename": "Lataavrishchikam/img1.jpg",
        "description": "Feet are in vrishchika and the left hand takes the lata pose, employed in jumping up in the sky."
    },
    {
        "filename": "Akshiptam/img1.jpg",
        "description": "Akshiptachari is performed, the hand in katakamukha or chatura is brought in, used in the movement of the vidushaka."
    }
    ,
    {
        "filename": "Aavartam/img1.jpg",
        "description": "The body rotates in a circular motion while the hands perform the vyavarta and parivartita movements. The feet follow the rechita movement, used to indicate circular motion or turning around."
    },
    {
        "filename": "Akshiptarechitam/img1.jpg",
        "description": "The hands perform the akshipta movement while the feet follow the rechita movement. This is used to indicate sudden movements or quick actions."
    },
    {
        "filename": "Apakraantam/img1.jpg",
        "description": "The body moves backward with the apakrantachari, while the hands perform the vyavarta movement. This is used to indicate retreat or stepping back."
    },
    {
        "filename": "Ardhsoochi/img1.jpg",
        "description": "The hands are in the suchimukha pose, and the feet are in the ardha suchi pose. This is used to indicate half-piercing or partial penetration."
    },
    {
        "filename": "Argalam/img1.jpg",
        "description": "The hands are crossed in front of the chest in the argala pose, and the feet are in the mandala stance. This is used to indicate obstruction or blocking."
    },
    {
        "filename": "Atikraantam/img1.jpg",
        "description": "The body moves forward with the atikrantachari, while the hands perform the vyavarta movement. This is used to indicate vigorous forward movement."
    },
    {
        "filename": "Avahittakam/img1.jpg",
        "description": "The hands are brought to the chest in the avahitta pose, and the feet are in the mandala stance. This is used to indicate gathering or collecting."
    },
    {
        "filename": "Chakramandalam/img1.jpg",
        "description": "The body moves in a circular motion while the hands form a mandala. This is used to indicate circular movements or cycles."
    },
    {
        "filename": "Dandapaadam/img1.jpg",
        "description": "The hands are in the dandapada pose, and the feet are in the mandala stance. This is used to indicate firmness or stability."
    },
    {
        "filename": "Dolaapaadam/img1.jpg",
        "description": "The hands are in the dola pose, and the feet are in the mandala stance. This is used to indicate swinging or swaying movements."
    },
    {
        "filename": "Elakaakreeditam/img1.jpg",
        "description": "The hands perform playful movements, and the feet follow the rechita movement. This is used to indicate playful or light-hearted actions."
    },
    {
        "filename": "Gajakriditakam/img1.jpg",
        "description": "The body mimics the movements of an elephant, with the hands in the gaja pose and the feet in the mandala stance. This is used to indicate elephant-like movements."
    },
    {
        "filename": "Gandasoochi/img1.jpg",
        "description": "The hands are in the suchimukha pose, and the feet are in the ganda suchi pose. This is used to indicate piercing or penetration."
    },
    {
        "filename": "Gangaavataranam/img1.jpg",
        "description": "The body mimics the descent of the Ganges, with the hands in the ganga pose and the feet in the mandala stance. This is used to indicate flowing or descending movements."
    },
    {
        "filename": "Garudaplutakam/img1.jpg",
        "description": "The body mimics the movements of Garuda, with the hands in the garuda pose and the feet in the mandala stance. This is used to indicate bird-like movements."
    },
    {
        "filename": "Gridhravalinakam/img1.jpg",
        "description": "The body mimics the movements of a vulture, with the hands in the gridhra pose and the feet in the mandala stance. This is used to indicate vulture-like movements."
    },
    {
        "filename": "Harinaplutam/img1.jpg",
        "description": "The body mimics the movements of a deer, with the hands in the harina pose and the feet in the mandala stance. This is used to indicate deer-like movements."
    },
    {
        "filename": "Janitam/img1.jpg",
        "description": "The hands are in the janita pose, and the feet are in the mandala stance. This is used to indicate creation or generation."
    },
    {
        "filename": "Karihastam/img1.jpg",
        "description": "The hands are in the karihasta pose, and the feet are in the mandala stance. This is used to indicate elephant trunk-like movements."
    },
    {
        "filename": "Katichinnam/img1.jpg",
        "description": "The hands are in the chinnam pose, and the feet are in the mandala stance. This is used to indicate cutting or severing actions."
    },
    {
        "filename": "Kunchitam/img1.jpg",
        "description": "The hands are in the kunchita pose, and the feet are in the mandala stance. This is used to indicate bending or curling movements."
    },
    {
        "filename": "Lalaatatilakam/img1.jpg",
        "description": "The hands are in the tilaka pose, and the feet are in the mandala stance. This is used to indicate marking or adorning."
    },
    {
        "filename": "Lolitam/img1.jpg",
        "description": "The hands are in the lola pose, and the feet are in the mandala stance. This is used to indicate swaying or swinging movements."
    },
    {
        "filename": "Madaskhalitam/img1.jpg",
        "description": "The body mimics the movements of someone intoxicated, with the hands in the mada pose and the feet in the mandala stance. This is used to indicate intoxication or stumbling."
    },
    {
        "filename": "Mayuralalitam/img1.jpg",
        "description": "The body mimics the movements of a peacock, with the hands in the mayura pose and the feet in the mandala stance. This is used to indicate peacock-like movements."
    },
    {
        "filename": "Naagaapasarpitam/img1.jpg",
        "description": "The body mimics the movements of a snake, with the hands in the naga pose and the feet in the mandala stance. This is used to indicate snake-like movements."
    },
    {
        "filename": "Nistambhitam/img1.jpg",
        "description": "The hands are in the nistambha pose, and the feet are in the mandala stance. This is used to indicate stillness or immobility."
    },
    {
        "filename": "Nitambam/img1.jpg",
        "description": "The hands are in the nitamba pose, and the feet are in the mandala stance. This is used to indicate hip movements or swaying."
    },
    {
        "filename": "Nivesham/img1.jpg",
        "description": "The hands are in the nivesha pose, and the feet are in the mandala stance. This is used to indicate settling or resting."
    },
    {
        "filename": "Ooroodvrittam/img1.jpg",
        "description": "The body moves in a circular motion while the hands perform the udvritta movement. This is used to indicate circular or rotating movements."
    },
    {
        "filename": "Paarsvajaanu/img1.jpg",
        "description": "The hands are in the parsva janu pose, and the feet are in the mandala stance. This is used to indicate side movements or lateral actions."
    },
    {
        "filename": "Paarsvakraantam/img1.jpg",
        "description": "The body moves sideways with the parsva krantachari, while the hands perform the vyavarta movement. This is used to indicate lateral or sideward movements."
    },
    {
        "filename": "Paarsvanikuttakam/img1.jpg",
        "description": "The hands are in the parsva nikuttaka pose, and the feet are in the mandala stance. This is used to indicate sideward tapping or knocking."
    },
    {
        "filename": "Parivrittam/img1.jpg",
        "description": "The body rotates while the hands perform the parivritta movement. This is used to indicate turning or rotating movements."
    },
    {
        "filename": "Prasarpitakam/img1.jpg",
        "description": "The body moves forward with the prasarita chari, while the hands perform the vyavarta movement. This is used to indicate creeping or crawling movements."
    },
    {
        "filename": "Prenkholitam/img1.jpg",
        "description": "The body sways while the hands perform the prenkholita movement. This is used to indicate swaying or swinging movements."
    },
    {
        "filename": "Sambhraantam/img1.jpg",
        "description": "The body moves with the sambhramachari, while the hands perform the vyavarta movement. This is used to indicate hurried or rushed movements."
    },
    {
        "filename": "Sannatam/img1.jpg",
        "description": "The hands are in the sannata pose, and the feet are in the mandala stance. This is used to indicate bowing or bending movements."
    },
    {
        "filename": "Sarpitam/img1.jpg",
        "description": "The body mimics the movements of a snake, with the hands in the sarpa pose and the feet in the mandala stance. This is used to indicate snake-like movements."
    },
    {
        "filename": "Shakataasyam/img1.jpg",
        "description": "The hands are in the shakata pose, and the feet are in the mandala stance. This is used to indicate cart-like movements."
    },
    {
        "filename": "Simhaakarsitam/img1.jpg",
        "description": "The body mimics the movements of a lion, with the hands in the simha pose and the feet in the mandala stance. This is used to indicate lion-like movements."
    },
    {
        "filename": "Simhavikreedhitakam/img1.jpg",
        "description": "The body mimics the playful movements of a lion, with the hands in the simha pose and the feet in the mandala stance. This is used to indicate playful lion-like movements."
    },
    {
        "filename": "Skhalitam/img1.jpg",
        "description": "The body mimics stumbling movements, with the hands in the skhalita pose and the feet in the mandala stance. This is used to indicate stumbling or tripping."
    },
    {
        "filename": "Soochi/img1.jpg",
        "description": "The hands are in the suchimukha pose, and the feet are in the mandala stance. This is used to indicate piercing or sharp movements."
    },
    {
        "filename": "Soochividdham/img1.jpg",
        "description": "The hands are in the suchividdha pose, and the feet are in the mandala stance. This is used to indicate piercing or penetration."
    },
    {
        "filename": "Talasamsphotitam/img1.jpg",
        "description": "The hands perform the talasamphotita movement, and the feet are in the mandala stance. This is used to indicate clapping or striking movements."
    },
    {
        "filename": "Talasanghattitam/img1.jpg",
        "description": "The hands perform the talasanghattita movement, and the feet are in the mandala stance. This is used to indicate rhythmic clapping or striking."
    },
    {
        "filename": "Talavilaasitam/img1.jpg",
        "description": "The hands perform the talavilasita movement, and the feet are in the mandala stance. This is used to indicate graceful hand movements."
    },
    {
        "filename": "Udghattitam/img1.jpg",
        "description": "The hands perform the udghattita movement, and the feet are in the mandala stance. This is used to indicate striking or hitting movements."
    },
    {
        "filename": "Udvrittam/img1.jpg",
        "description": "The body moves upward with the udvritta movement, while the hands perform the vyavarta movement. This is used to indicate upward or rising movements."
    },
    {
        "filename": "Upasritakam/img1.jpg",
        "description": "The body moves forward with the upasrita chari, while the hands perform the vyavarta movement. This is used to indicate approaching or moving closer."
    },
    {
        "filename": "Uromandalam/img1.jpg",
        "description": "The hands form a mandala in front of the chest, and the feet are in the mandala stance. This is used to indicate circular movements or gestures."
    },
    {
        "filename": "Vakshaswastikam/img1.jpg",
        "description": "The hands form a swastika in front of the chest, and the feet are in the mandala stance. This is used to indicate auspicious or sacred gestures."
    },
    {
        "filename": "Vidyudbhraantam/img1.jpg",
        "description": "The body mimics the movements of lightning, with the hands in the vidyut pose and the feet in the mandala stance. This is used to indicate quick or sudden movements."
    },
    {
        "filename": "Vinivrittam/img1.jpg",
        "description": "The body moves backward with the vinivritta movement, while the hands perform the vyavarta movement. This is used to indicate retreat or stepping back."
    },
    {
        "filename": "Vishkambham/img1.jpg",
        "description": "The hands are in the vishkambha pose, and the feet are in the mandala stance. This is used to indicate support or holding."
    },
    {
        "filename": "Vishnukraantam/img1.jpg",
        "description": "The body moves forward with the vishnu krantachari, while the hands perform the vyavarta movement. This is used to indicate vigorous forward movement."
    },
    {
        "filename": "Vivartitakam/img1.jpg",
        "description": "The body rotates while the hands perform the vivartita movement. This is used to indicate turning or rotating movements."
    },
    {
        "filename": "Vivrittam/img1.jpg",
        "description": "The body moves outward with the vivritta movement, while the hands perform the vyavarta movement. This is used to indicate expanding or opening movements."
    },
    {
        "filename": "Vrishabhakreeditam/img1.jpg",
        "description": "The body mimics the movements of a bull, with the hands in the vrishabha pose and the feet in the mandala stance. This is used to indicate bull-like movements."
    }
    
]
